# Exc001 난수 0과 1만 랜덤하게 나오기
from random import *
i = randint(1,101)
# Exc002 난수 1~45만 랜덤하게 나오기(로또 6개)

# Exc003 Happy Birthday
#   1. 글자 갯수
#   2. 0번째 글자
#   3. B 찾기
#   4. C 찾기
#   5. 전부 소문자로 출력
#   6. 전부 대문자로 출력
#   7. 4번째 글자에서 마지막까지 출력
#   8. 4번째에서 7번째 글자까지 출력
# Exc004 주민번호를 이용해 나이와 성별 출력하기 jumin = "0012303234567"
# Exc005 이메일에 @이 있으면 분리해서 출력 "admin@email.com"
# Exc006 h를 찾아 H로 변경 mess = "hello Hi HaHa"
# Exc007 문자열의 맨 앞, 맨 뒤 공백 제거 mess = "    S K Y    "
# Exc008 num_rank = [10, -20, 3, -40, 5]
#   1. 음수의 갯수 구하기
#   2. 양수 중에서 홀수의 합
#   3. num_rank[4] 요소의 등수
#   4. 최대값, 최소값 구하기
# Exc009 name = ["아이언맨","헐크","캡틴","토르","호크아이"]
#        kor = [100, 20, 90, 70, 35]
#        eng = [100, 50, 95, 80, 100]
#        mat = [100, 30, 90, 60, 100]
#   1. 평균 구하기
#   2. 등수 구하기
#   3. 합격, 재시험, 불합격
#      평균이 60점 이상이면 합격
#      합격에서도 국영수 중 한 과목이라도 40점 미만이면 재시험. 아니면 불합격
#      평균 95점 이상이면 장학생
#      평균 10점당 * 한 개씩
# Exc010 계산기
#   1. 숫자 입력받기:
#      -10000 ~ 10000 사이에서만 입력 가능하게
#      - 잘못 입력 받으면 다시 입력받기
#   2. 숫자 입력받기
#      -10000 ~ 10000 사이에서만 입력 가능하게
#      - 잘못 입력 받으면 다시 입력받기
#   3. 연산자 입력받기
#      - +,-,*,/ 만 입력가능하게
#      - 잘못 입력 받으면 다시 입력받기
#   4. 각각의 계산기능 출력
#   5. 계산이 끝났으면 다시하겠습니까?(y/n) 출력